resume_2018_v1_EN.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-05 日 19:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Yuan Long</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Yuan Long</h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><i>Current Position:</i></td>
<td class="org-left">ZTE Big Data Developer</td>
<td class="org-left">&#xa0;</td>
<td class="org-right"><i>Phone:</i></td>
<td class="org-left">18118801655</td>
<td class="org-left">&#xa0;</td>
<td class="org-right"><i>Site:</i></td>
<td class="org-left"><a href="https://yiddishkop.github.io/">yiddishkop's blog</a></td>
</tr>

<tr>
<td class="org-right"><i>Applied For:</i></td>
<td class="org-left">ML Algorithm Engineer</td>
<td class="org-left">&#xa0;</td>
<td class="org-right"><i>Add:</i></td>
<td class="org-left">NanJing</td>
<td class="org-left">&#xa0;</td>
<td class="org-right"><i>Email:</i></td>
<td class="org-left">yiddishkop@163.com</td>
</tr>
</tbody>
</table>



<div id="orgd34e820" class="outline-2">
<h2 id="orgd34e820">Summary</h2>
<div class="outline-text-2" id="text-orgd34e820">
<ul class="org-ul">
<li>8+ years work experience in the fields of CS includes <b>Big Data Spark development</b> and <b>Machine Learning</b> technologies</li>
<li>Good knowledge of Data Mining including <b>Perceptron, LR, GBDT, SVM, RandomForest</b></li>
<li>Good knowledge of Deep Learning including <b>CNN, RNN, GAN, LSTM</b></li>
<li>Good knowledge of Reinforcement Learning including <b>Q-learning, SARSA</b></li>
<li>Hands on experience in Machine Learning packages including <b>Numpy, Scipy, Matplotlib, Pandas, SparkML</b></li>
<li>Hands on experience in Machine Learning framework including <b>Scikit-learn, Tensorflow</b></li>
<li>Hands on experience in Spark ecosystem including <b>Spark, MapReduce, SparkSQL, SparkML</b></li>
<li>Hands on experience in RDD architecture, implementing <b>Spark</b> operations on RDD and optimizing transformations</li>
<li>Hands on experience in <b>High Concurrency</b> by <b>Scala</b> and <b>AKKA</b></li>
<li>Experience in Functional Programming Language including <b>Scala, Lisp</b></li>
</ul>
</div>
</div>

<div id="org82c3ac1" class="outline-2">
<h2 id="org82c3ac1">Technical Skills</h2>
<div class="outline-text-2" id="text-org82c3ac1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Machine Learning Framework</b></td>
<td class="org-left"><b>Spark Eco-system</b></td>
</tr>

<tr>
<td class="org-left">Numpy, Scipy, Matplotlib, Pandas, Scikit-learn, Tensorflow</td>
<td class="org-left">Spark, SparkSQL, SparkML</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><b>Programming Language</b></td>
<td class="org-left"><b>Machine Learning Algorithms</b></td>
</tr>

<tr>
<td class="org-left">Python, Scala, Java, C, lisp</td>
<td class="org-left">LR, GBDT, SVM, RF, CNN, RNN, GAN, LSTM, Q-learning</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><b>Operating Systems</b></td>
<td class="org-left"><b>Develop tools</b></td>
</tr>

<tr>
<td class="org-left">Linux, Mac OS</td>
<td class="org-left">Emacs, Vim, Git</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="org70385d5" class="outline-2">
<h2 id="org70385d5">Work Experience</h2>
<div class="outline-text-2" id="text-org70385d5">
</div>
<div id="orgb027125" class="outline-4">
<h4 id="orgb027125">Data Engineer - Spark, SparkML</h4>
<div class="outline-text-4" id="text-orgb027125">
<p>
<i>Time : 01/2017 to Present, <b>ZTE</b> - NanJing</i> .
</p>

<p>
<i>Description : ZTE IPTV 'ZXCLOUD GoldenData' Big Data analytics platform.</i>
</p>

<ul class="org-ul">
<li>Migrated MapReduce jobs into <b>Spark RDD</b> transformations using Scala</li>
<li>Worked with analytics team to build statistical models including <b>K-means, LR, GBDT</b> using <b>SparkML</b></li>
<li>Implemented Spark using <b>SparkSQL</b> for faster processing of data</li>
<li>Developed Spark jobs to parse the <b>JSON</b> and <b>XML</b> data</li>
<li>Optimizing of existing algorithms in Hadoop using Spark Context, <b>SparkSQL</b>, <b>Data Frame</b> and <b>Pair RDD</b>.</li>
<li>Used <b>SBT</b> scripts to fetch, build, deploy application to development enviroment</li>
</ul>
</div>
</div>

<div id="org584909e" class="outline-4">
<h4 id="org584909e">Senior Software Developer - Embedded OS, C, Assembly Language</h4>
<div class="outline-text-4" id="text-org584909e">
<p>
<i>Time : 01/2015 to 12/2016, <b>ZTE</b> - NanJing</i> .
</p>

<p>
<i>Description : ZTE OS development of 'T800' Router, 'GPON9112/9113' Optical Network Terminals</i>
</p>

<ul class="org-ul">
<li>Refactored the existing <b>bootloader</b> using assembly language</li>
<li>Completed API of the Routing Subsystem</li>
<li>Completed API of SDRAM cache memory management</li>
<li>Proposed and completed an <b>automatically testing framework</b> under secureCRT using python</li>
<li>Completed coding of <b>AIO(Assynchronized Non-blocking I/O)</b> protocal &#x2014; tr069</li>
<li>Maintained makefile of project</li>
</ul>
</div>
</div>

<div id="orga62b895" class="outline-4">
<h4 id="orga62b895">J2EE Developer - Hibernate, Spring, Java</h4>
<div class="outline-text-4" id="text-orga62b895">
<p>
<i>Time : 07/2009 to 12/2014, <b>DaKun management consultants,inc</b> - ShenZhen</i> .
</p>

<p>
<i>Description : DaKun is a start-up focuses on company management consulting, this project is a HR management system</i>
</p>

<ul class="org-ul">
<li>Website persistence layer development using <b>Hibernate</b> framework</li>
<li>Developed database schema and <b>SQL</b> queries for querying, inserting and managing database</li>
<li>Implemented various design patterns in the project such as <b>Builder, Singleton, Proxy patterns</b>.</li>
<li>Performed unit testing using <b>JUnit</b></li>
</ul>
</div>
</div>
</div>

<div id="org0e50ce6" class="outline-2">
<h2 id="org0e50ce6">Education</h2>
<div class="outline-text-2" id="text-org0e50ce6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><i>study program</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Master of Science</td>
<td class="org-left">Computer Science</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">University</td>
<td class="org-left">NanJing University of Science and Technology</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><i>ML mooc courses</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">NTU</td>
<td class="org-left"><a href="https://www.csie.ntu.edu.tw/~htlin/course/mltech17spring/">ML Foundations &amp; Technical</a></td>
<td class="org-left">my lecNotes, HW, Final Project</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">NTU</td>
<td class="org-left"><a href="http://speech.ee.ntu.edu.tw/~tlkagk/courses_MLDS17.html">DL with deep and structured</a></td>
<td class="org-left">my lecNotes, HW, Final Project</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Ucberkeley</td>
<td class="org-left"><a href="https://people.eecs.berkeley.edu/~jrs/189/">cs-189: Intro to ML</a></td>
<td class="org-left">my lecNotes, HW, Final Project</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Ucberkeley</td>
<td class="org-left"><a href="http://rail.eecs.berkeley.edu/deeprlcourse-fa17/index.html">cs-294: Deep Reinforcement Learning</a></td>
<td class="org-left">my lecNotes, HW, Final Project</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Stanford</td>
<td class="org-left"><a href="https://web.stanford.edu/class/cs20si/2017/">cs-20SI: DL with Tensorflow</a></td>
<td class="org-left">my lecNotes, HW, Final Project</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>
